{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_33", "dtype": "float32", "output_dim": 300, "trainable": true, "embeddings_regularizer": null, "input_dim": 5000, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 100], "activity_regularizer": null, "input_length": 100}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_44"}}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_22", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 250, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_21", "trainable": true, "data_format": "channels_last", "pool_size": [2], "padding": "valid", "strides": [2]}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_45", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 250, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_45"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_10", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_46", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_33"}, "backend": "tensorflow"}