_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_33 (Embedding)     (None, 100, 300)          1500000   
_________________________________________________________________
dropout_44 (Dropout)         (None, 100, 300)          0         
_________________________________________________________________
conv1d_22 (Conv1D)           (None, 98, 250)           225250    
_________________________________________________________________
max_pooling1d_21 (MaxPooling (None, 49, 250)           0         
_________________________________________________________________
dense_45 (Dense)             (None, 49, 250)           62750     
_________________________________________________________________
dropout_45 (Dropout)         (None, 49, 250)           0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 12250)             0         
_________________________________________________________________
dense_46 (Dense)             (None, 1)                 12251     
=================================================================
Total params: 1,800,251
Trainable params: 1,800,251
Non-trainable params: 0
_________________________________________________________________
